app/controllers/bloggers_controller.rb

SELECT "bloggers".* FROM "bloggers"
---
  def index
    @bloggers = Blogger.all

INSERT INTO "bloggers" ("titulo", "contenido", "link", "tipo", "estado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["titulo", "nasldknasld"], ["contenido", "fdsfasfd"], ["link", "asf"], ["tipo", 1], ["estado", 1], ["created_at", "2022-12-22 22:42:42.585653"], ["updated_at", "2022-12-22 22:42:42.585653"]]
---
  def create
    @blogger = Blogger.new(blogger_params)

    respond_to do |format|
      if @blogger.save

DELETE FROM "bloggers" WHERE "bloggers"."id" = ?  [["id", 1]]
---
  def destroy
    @blogger.destroy

SELECT "bloggers".* FROM "bloggers" WHERE "bloggers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_blogger
      @blogger = Blogger.find(params[:id])