app/controllers/noticia_controller.rb

SELECT "noticia".* FROM "noticia"
---
  def index
    @noticias = Noticia.all